## Data Cleaning

Empezamos por importar las librerias necesarias, configurar el espacio de trabajo y importar todos los archivos sobre los cuales vamos a trabajar.

In [186]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [187]:
from repo_funciones import * #repositorio propio de funciones
import re #para expresiones regulares

In [188]:
actor=pd.read_csv('../Data/actor.csv') 
category=pd.read_csv('../Data/category.csv')
film=pd.read_csv('../Data/film.csv')
inventory=pd.read_csv('../Data/inventory.csv')
language=pd.read_csv('../Data/language.csv')
old_HDD=pd.read_csv('../Data/old_HDD.csv')
rental=pd.read_csv('../Data/rental.csv')

## Metodología

La metodología sigue los siguientes pasos:

 - .head() para un vistazo inicial de cada tabla
 - .info() 
    - double-check dtypes
    - valores nulos
- formula propia "uniquecols". Devuelve el conteo de valores unicos por columna.
   - el conteo de unicos en "ID" de cada tabala tiene que ser igual al numero de filas, para SQL.
   - las columnas con 1 valor unico se borran, ya que no aportan información.

- duplicated().any() ver si hay duplicados. 
   - en ciertas instancias hemos ido mas allá y verificado duplicados usando subset de columnas.

Limpieza tabla "Actor"

In [189]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [190]:
nancols(actor)

Series([], dtype: int64)

In [191]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [192]:
unique_cols(actor)

actor_id       200
first_name     128
last_name      121
last_update      1
dtype: int64

In [193]:
actor = actor.drop("last_update", axis=1) #esta columna no aporta valor informativo. Solo tiene un valor unico.

In [194]:
actor.duplicated().unique()

array([False])

In [195]:
actor.loc[actor[['first_name', 'last_name']].duplicated(keep=False)]

     actor_id first_name last_name
100       101      SUSAN     DAVIS
109       110      SUSAN     DAVIS

In [196]:
actor.drop_duplicates(['first_name', 'last_name'], keep=False, inplace=True)

In [197]:
actor['full_name']=actor.first_name +' '+ actor.last_name

Limpieza tabla "category"

In [198]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [199]:
unique_cols(category)

category_id    16
name           16
last_update     1
dtype: int64

In [200]:
category = category.drop("last_update", axis=1) #esta columna no aporta valor informativo. Solo tiene un valor unico.

In [201]:
nancols(category)

Series([], dtype: int64)

In [202]:
category.duplicated().unique()

array([False])

Limpieza tabla "film"

In [203]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [204]:
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [205]:
film = film.drop(["last_update", "original_language_id"], axis=1)

In [206]:
unique_cols(film) #intuitivamente quise borrar la columna de language_id por contener un unico valor pero luego me di cuenta que hay otra tabla de idiomas
#se mantiene ya que sera la llave que interconecte las tablas en SQL. En este caso solo hay pelis en inglés, pero queda lista para albergar varios idiomas si fuese el caso.

film_id             1000
title               1000
description         1000
length               140
replacement_cost      21
special_features      15
rental_duration        5
rating                 5
rental_rate            3
release_year           1
language_id            1
dtype: int64

In [207]:
film = film.drop("release_year", axis=1)

In [208]:
film.duplicated().unique()

array([False])

Limpieza tabla "inventory"

In [209]:
#inventory.hed()
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [210]:
inventory = inventory.drop("last_update", axis=1)

In [211]:
unique_cols(inventory)

inventory_id    1000
film_id          207
store_id           2
dtype: int64

In [212]:
inventory.duplicated().unique()

array([False])

Limpieza tabla "language"

In [213]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [214]:
language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [215]:
language.duplicated().unique()

array([False])

Limpieza tabla old_HDD

In [216]:
old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [217]:
old_HDD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [218]:
unique_cols(old_HDD)

title           614
first_name       38
last_name        37
category_id      16
release_year      1
dtype: int64

In [219]:
old_HDD= old_HDD.drop("release_year", axis=1)

In [220]:
old_HDD.duplicated().unique()

array([False])

In [221]:
old_HDD.loc[old_HDD[['first_name', 'last_name', 'title']].duplicated(keep=False)] #por si acaso hay duplicados con este subset de columnas

Empty DataFrame
Columns: [first_name, last_name, title, category_id]
Index: []

In [222]:
old_HDD['full_name']=old_HDD.first_name +' '+ old_HDD.last_name

Limpieza tabal "Rental"

In [223]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [224]:
rental= rental.drop('last_update', axis=1)

In [225]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

In [226]:
unique_cols(rental)

rental_id       1000
inventory_id    1000
rental_date      999
return_date      997
customer_id      485
staff_id           2
dtype: int64

In [227]:
rental.duplicated().unique()

array([False])

Probando merges

In [228]:
'''count = 0
for title in old_HDD['title']:
    if title in film['title'].values:
        count += 1
print(count)'''

"count = 0\nfor title in old_HDD['title']:\n    if title in film['title'].values:\n        count += 1\nprint(count)"

In [229]:
'''count2=0
for name in old_HDD['full_name']:
    if name in actor['full_name'].values:
        count += 1
print(count)'''

"count2=0\nfor name in old_HDD['full_name']:\n    if name in actor['full_name'].values:\n        count += 1\nprint(count)"

In [230]:
title_catid = pd.merge(film, old_HDD[['title', 'category_id']], on='title', how='left')
film['category_id'] = title_catid['category_id']

In [231]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",6.0
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",6.0
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes,11.0

In [232]:
nancols(film) #no todas tenian esta información de old_hdd. Hay que remplazar estos nulos por 17 y indicar en la tabla de cat una nueva cat 17="unknown"

category_id    275
dtype: int64

In [233]:
film['category_id']=film['category_id'].fillna(17)

In [234]:
film['category_id']=film['category_id'].astype(int)

In [243]:
new_row = pd.DataFrame({'category_id': [17], 'name': ['unknown']})
category = pd.concat([category, new_row]).reset_index(drop=True)

In [235]:
old_HDD.head() 
''' 

Esta tabla la vamos a usar como conectora entre la tabla de peliculas y la tabla de actores. 

Por lo tanto nos interesa: 
 - vincular los IDs de la tabla actores a los full name de tabla old_HDD
 - vincular los IDS de las peliculas a los titulos de tabla old_HDD
 - crear una nueva columna 'film_actor_id' que cree un indice para las distintas combinaciones de title_id y actor_id (parece ser que esto se hará automaticamente no hace falta aqui)

 No nos interesa:
 - las columnas de first name, last name, title, category y full name. dejando unicamente: film_actor_id, film_id y actor_id

'''

" \n\nEsta tabla la vamos a usar como conectora entre la tabla de peliculas y la tabla de actores. \n\nPor lo tanto nos interesa: \n - vincular los IDs de la tabla actores a los full name de tabla old_HDD\n - vincular los IDS de las peliculas a los titulos de tabla old_HDD\n - crear una nueva columna 'film_actor_id' que cree un indice para las distintas combinaciones de title_id y actor_id (parece ser que esto se hará automaticamente no hace falta aqui)\n\n No nos interesa:\n - las columnas de first name, last name, title, category y full name. dejando unicamente: film_actor_id, film_id y actor_id\n\n"

In [236]:
merged = pd.merge(old_HDD, film[['film_id', 'title']], on='title', how='left')

In [237]:
merged.head()

,first_name,last_name,title,category_id,full_name,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,6,PENELOPE GUINESS,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2,PENELOPE GUINESS,23
2,PENELOPE,GUINESS,ANGELS LIFE,13,PENELOPE GUINESS,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,10,PENELOPE GUINESS,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,14,PENELOPE GUINESS,140

In [238]:
merged = pd.merge(merged, actor[['actor_id', 'full_name']], on='full_name', how='left')

In [239]:
merged = merged.drop(['first_name', 'last_name', 'title', 'category_id', 'full_name'], axis=1)

In [246]:
actor=actor.drop(['first_name', 'last_name'] , axis=1)

In [253]:
language=language.drop(['last_update'],axis=1)

In [256]:
language = language.rename(columns={'name': 'language'}) 
#name es una palabra reservada en SQL...al querer hacer referencia a esta columna de la tabla, SQL no entiende

In [258]:
category = category.rename(columns={'name': 'category'})
#no hacia tanta falta en verdad. Puedes ponerlo entre comillas en SQL para que no lo asocie a la palabra reservada
#tambien puedes cambiar nombres de columna directamente desde workbench. learnings...

In [262]:
rental.loc[rental['inventory_id'].et]

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id]
Index: []

In [267]:
rental['inventory_id'].head

<bound method NDFrame.head of 0       367
1      1525
2      1711
3      2452
4      2079
5      2792
6      3995
7      2346
8      2580
9      1824
10     4443
11     1584
12     2294
13     2701
14     3049
15      389
16      830
17     3376
18     1941
19     3517
20      146
21      727
22     4441
23     3273
24     3961
25     4371
26     1225
27     4068
28      611
29     3744
30     4482
31     3832
32     1681
33     2613
34     1286
35     1308
36      403
37     2540
38     4466
39     2638
40     1761
41      380
42     2578
43     3098
44     1853
45     3318
46     2211
47     1780
48     2965
49     1983
50     1257
51     4017
52     1255
53     2787
54     1139
55     1352
56     3938
57     3050
58     2884
59      330
60     4210
61      261
62     4008
63       79
64     3552
65     1162
66      239
67     4029
68     3207
69     2168
70     2408
71     2260
72      517
73     1744
74     3393
75     3021
76     1303
77     4067
78     3299
79     2478
80     2610
81     1388
82      466
83     1829
84      470
85     2275
86     1586
87     2221
88     2181
89     2984
90      139
91      775
92     4360
93     1675
94      178
95     3418
96     1283
97     2970
98      535
99     2599
100     617
101     373
102    3343
103    4281
104     794
105    3627
106    2833
107    3289
108    1044
109    4108
110    3725
111    2153
112    2963
113    4502
114     749
115    4453
116    4278
117     872
118    1359
119      37
120    1053
121    2908
122    1795
123     212
124     952
125    2047
126    2026
127    4322
128    4154
129    3990
130     815
131    3367
132     399
133    2272
134     103
135    2296
136    2591
137    4134
138     327
139     655
140     811
141    4407
142     847
143    1689
144    3905
145    1431
146     633
147    4252
148    1084
149     909
150    2942
151    2622
152    3888
153    1354
154     288
155    3193
156     887
157    2395
158    3453
159    1885
160    2941
161    1229
162    2306
163    1070
164    2735
165    3894
166     865
167    2714
168    1758
169    3688
170    4483
171    2873
172    3596
173    3954
174    4346
175     851
176    3545
177    1489
178    2575
179    2752
180    2417
181    4396
182    2877
183    1970
184    2598
185    1799
186    4004
187    3342
188     984
189    3962
190    4365
191    1897
192    3900
193    1337
194     506
195     190
196    4212
197    1789
198    2135
199    3926
200     776
201     674
202    3374
203    1842
204     303
205    1717
206     102
207    3669
208     729
209    1801
210    4005
211     764
212    1505
213    1453
214     679
215    1398
216    4395
217    2291
218    3074
219    1259
220    3578
221    2745
222    3121
223    4285
224     651
225    4181
226     214
227     511
228    1131
229    1085
230    4032
231    2945
232     715
233    1321
234    3537
235    1265
236     241
237     503
238     131
239    3420
240    4438
241    2095
242    1721
243    1041
244    3045
245    2829
246    4095
247    1913
248    2428
249     368
250    4352
251    1203
252    2969
253    1835
254    3264
255    3194
256    2570
257    3534
258      30
259     435
260    1369
261    4261
262    1160
263    2069
264    2276
265    3303
266    1206
267    1714
268    3501
269     207
270    2388
271     971
272    1590
273     656
274    1718
275    1221
276    1409
277     182
278     661
279    1896
280    1208
281    4486
282    3530
283     350
284    2486
285     314
286    3631
287    3546
288    2449
289    2776
290     485
291    4264
292    1828
293    2751
294    4030
295    3878
296    1594
297    1083
298    4376
299     249
300    3448
301    2921
302    1111
303    1701
304    2665
305    2781
306    1097
307     187
308    1946
309     593
310    2830
311    2008
312    4156
313    2851
314    2847
315    3828
316      26
317    2559
318    3024
319    1090
320    4556
321    2362
322    3364
323    2510
324    3979
325    2678
326    2524
327    2659
328    1536
329    1872
330    1529
331    4001
332    3973
333    1411
334    1811
335     751
336    2596
337    2410
338     946
339    4168
340    4019
341    3301
342    2327
343    1396
344    4319
345    1625
346    1825
347    2920
348    2756
349    3371
350    4369
351    3989
352    2058
353     141
354    2868
355    4417
356    1925
357    1156
358    3489
359       6
360    2324
361    4282
362     833
363    2887
364     360
365    3437
366    1247
367     944
368    3347
369    1235
370    4089
371    1649
372    4420
373    1815
374    3197
375    3012
376    2242
377    3462
378    1777
379    2748
380    4358
381     955
382     910
383    1565
384    1288
385    2684
386     434
387     691
388    3759
389    2193
390     263
391     145
392    1890
393     752
394    1020
395    4193
396    1686
397     553
398     258
399    2179
400     461
401    3983
402    1293
403    4090
404    2136
405    1077
406    1438
407    3652
408    4010
409    1434
410    1400
411    3516
412    1019
413    3698
414    2371
415    2253
416    3063
417    2514
418     619
419    2985
420    1152
421    1783
422    2815
423    1518
424    1103
425    1677
426    3349
427     129
428    1920
429    4507
430    1119
431    4364
432    3360
433    3328
434    4317
435    1800
436    4260
437     354
438    4452
439    1578
440    1457
441    2021
442     723
443    1757
444    1955
445    3890
446    2671
447    2469
448    1343
449     205
450    2993
451    4425
452    3499
453    3344
454    1699
455    2368
456    3350
457     597
458    4238
459    2077
460    2314
461     826
462    1313
463      20
464    1786
465     339
466    2656
467    4463
468    1613
469    2872
470    1338
471     802
472    1474
473    2520
474    2451
475    2437
476     424
477    2060
478    2108
479      72
480    4178
481    1510
482    3115
483    2392
484    1822
485    3774
486     393
487    1940
488    3524
489    1326
490    1999
491     184
492    1850
493    1007
494    1785
495    2636
496     458
497    2381
498    4500
499     601
500    3131
501    3005
502    2086
503      71
504     667
505    3621
506    4179
507    3416
508    4338
509    3827
510    2176
511     225
512    1697
513    3369
514    4357
515     234
516    4087
517    3564
518    3845
519    2397
520    3195
521    1905
522    1962
523    1817
524    1387
525     266
526    1655
527    2624
528    3332
529    1113
530    2793
531    4306
532     992
533    4209
534    2962
535    3095
536    2262
537    3427
538    3321
539    1662
540    4444
541     530
542    2964
543    1086
544     487
545    2065
546    3704
547    1818
548    3632
549    3119
550      23
551    1349
552    1951
553    4397
554    1814
555     158
556    4163
557    1227
558     644
559     928
560    3390
561      53
562    2973
563    1494
564    4330
565    3308
566    2232
567    4534
568    1122
569    4250
570    1899
571    4020
572    3883
573    4451
574    1866
575     375
576    2938
577    3481
578    3515
579    1380
580    4579
581    2679
582    1833
583    3544
584     898
585    1413
586      95
587    4231
588     473
589     377
590     638
591    1810
592    2766
593     595
594     821
595    4469
596     599
597    4136
598    1567
599    3225
600    1300
601    3248
602    1585
603    4232
604    3509
605    2561
606    4254
607    2944
608    3642
609    1230
610    2180
611     270
612     280
613    3397
614     989
615    4142
616    4445
617    2482
618    2444
619    1144
620    2363
621    1222
622    3660
623    2889
624     452
625     425
626    2513
627    1527
628    1254
629    2465
630    1287
631      58
632    2630
633    1648
634    4213
635    1581
636    2685
637    4204
638     495
639    3548
640     140
641    3105
642    4304
643    3128
644    1922
645    3435
646    3476
647    1781
648    4384
649     739
650    1201
651     126
652    2312
653     331
654    2846
655     848
656    3226
657    1382
658    1414
659    2247
660    2968
661    3997
662      87
663    1012
664    3075
665     797
666    3528
667    3677
668     227
669    1027
670     697
671    1769
672    1150
673    1273
674    2329
675    4558
676    3741
677     907
678    4147
679    3346
680    3160
681    2038
682    3242
683    1385
684    2441
685    1731
686    4135
687     742
688    2646
689    4034
690     800
691     635
692     592
693    4276
694    2076
695    3949
696    1412
697     130
698     500
699     372
700    2556
701    1123
702    2628
703    2809
704    2278
705     819
706    3133
707    2459
708     194
709    4581
710    4191
711    3664
712    2010
713    2030
714      85
715    1383
716    1736
717     267
718    3687
719    1116
720    4540
721    3407
722    3770
723    4088
724     933
725    1629
726     242
727    1688
728    3473
729    4124
730    2530
731    2951
732    3084
733    3421
734    3689
735     769
736    2284
737    1183
738     600
739    3189
740     273
741    2528
742    3722
743     581
744    4272
745    1993
746    2803
747    1146
748     730
749    2711
750    1720
751    1021
752     734
753    3090
754    3152
755    1067
756    1191
757    2367
758    3250
759    2342
760    3683
761    2022
762    1069
763     515
764    2154
765     687
766    2895
767    1523
768    2491
769     353
770    3319
771     245
772    1188
773    1197
774    4339
775     451
776    1816
777     533
778    1919
779      88
780    2255
781    3046
782    2936
783      39
784    2637
785    3919
786     763
787     708
788    2858
789    1554
790    2841
791     379
792    1995
793     609
794    2697
795    1446
796    1102
797    1713
798     441
799    1642
800     785
801    1602
802    3909
803    3132
804    2386
805    2195
806    1928
807    2114
808    2533
809    4419
810    1099
811    4554
812    1572
813    3757
814     630
815     186
816    4106
817     623
818    2584
819    3380
820    2634
821    3249
822    3518
823     712
824    2263
825      62
826    2468
827    1684
828    3464
829    3912
830    1381
831    2898
832    3628
833     299
834    3140
835     977
836    2859
837    1886
838    4049
839    4318
840    2328
841    2214
842     536
843    2001
844     938
845    4387
846    1363
847    2424
848    2390
849    2780
850    1622
851    3693
852     921
853    2527
854    3969
855    2569
856    1258
857    3032
858     578
859    3711
860    1186
861    3999
862    2777
863    3183
864    2867
865    3389
866    3604
867    3399
868    2903
869    4573
870    3904
871    4568
872     363
873    1428
874    1471
875     886
876    4265
877    4021
878    1819
879     602
880    3841
881    2271
882    4079
883     646
884    4356
885    2727
886     387
887    1299
888    1464
889    2611
890     471
891    3260
892    1118
893    2744
894    2817
895    1334
896    3497
897    1096
898    3543
899     760
900    1514
901    2423
902    2466
903    4372
904    1862
905    3320
906    4427
907    3775
908    2601
909    1404
910    3200
911    3213
912    1393
913    1859
914    1290
915    3629
916     818
917    4052
918    3860
919    1827
920    2442
921    1884
922    3279
923    3203
924    4327
925    1158
926     246
927    4296
928    2835
929    3384
930     719
931    3672
932    3595
933    2421
934     901
935    1054
936    1521
937    1314
938    1278
939    3630
940    4279
941    3737
942     151
943    1441
944    1264
945    4478
946     585
947    2202
948     491
949    1395
950    4389
951    2194
952    1231
953    4140
954     647
955    4428
956     548
957    3108
958    1966
959    3293
960    4535
961    1921
962     657
963    3363
964    1294
965    1954
966     119
967     443
968    1520
969    2911
970       2
971    1914
972    2617
973    3109
974    2290
975    2029
976     407
977    3917
978    4169
979    2913
980    3560
981      63
982    2305
983    1573
984    4045
985     390
986    1364
987    4388
988    4171
989    2863
990    3572
991    2080
992    2798
993      17
994    2075
995    4243
996    3395
997    4433
998    1774
999    1498
Name: inventory_id, dtype: int64>

Exportar tablas

In [259]:

#actor.to_csv('../Data/actor_clean.csv', index=False) 
category.to_csv('../Data/category_clean.csv', index=False) 
#film.to_csv('../Data/film_clean.csv', index=False) 
#inventory.to_csv('../Data/inventory_clean.csv', index=False) 
language.to_csv('../Data/language_clean.csv', index=False) 
#old_HDD.to_csv('../Data/old_HDD_clean.csv', index=False) 
#rental.to_csv('../Data/rental_clean.csv', index=False) 
#merged.to_csv('../data/film_actor.csv', index = False)